app/controllers/produtos_controller.rb

    def index
        @produtos_por_nome = Produto.order(:nome).limit 5
        @produtos_por_preco = Produto.order(:preco).limit 2
---
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2

    def new
        @produto = Produto.new
        @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

    def busca
        @nome_a_buscar = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%bermuda%')

    def update
        if @produto.update produto_params
---
UPDATE "produtos" SET "nome" = ?, "preco" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Terno social lindíssimo social"], ["preco", 200.0], ["updated_at", "2018-03-29 18:31:09.555267"], ["id", 13]]

    def create
        @produto = Produto.new produto_params
        if @produto.save
---
INSERT INTO "produtos" ("nome", "preco", "descricao", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Camiseta"], ["preco", 20.0], ["descricao", "camiseta azul pra homens"], ["quantidade", 10], ["created_at", "2018-03-21 13:21:28.154352"], ["updated_at", "2018-03-21 13:21:28.154352"]]

    def set_produto
        id = params[:id]
        @produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 5]]